import { useState, useEffect } from "react";
import classes from "./GenerateTitleForNewBlogOrNews.module.css";
import { useParams } from "react-router-dom";
import img from "/Public/blogAndNews/st.Valentines.jpg";

export default function GeneratedClickedBlogOrNews() {
  //const [blogOrNews, setBlogOrNews] = useState([]);

  const [blogOrNews, setBlogOrNews] = useState([
    {
      ID: 1,
      Title: "5 км. Става на 5 години",
      Pic: "5kmRD",
      PostedDate: "2/14/2026",
      PostedBy: "Irina",
      BOrN: "blog",
      InfoBlogAndNews: "Рожден ден на 5км Шумен на Шуменското плато",
    },
    {
      ID: 2,
      Title: "Празник на любовта.Виното.Бягането",
      Pic: "../../images/blogAndNewsImages/st.Valentines.jpg",
      PostedDate: "3/14/2026",
      PostedBy: "Irina",
      BOrN: "blog",
      InfoBlogAndNews:
        "Свети Валентин е християнски празник в памет на свещеномъченика Валентин Римски отбелязван от православните църкви на 6 юли а от западните църкви на 14 февруари. През XIV век в Западна Европа 14 февруари започва да се свързва с романтиката и днес празникът е популярен преди всичко като Ден на любовта.На тази дата двойките изразяват любовта си един към друг като си изпращат поздравителни картички и подаръци със стилизирана форма на сърце. Традиционно се празнува в англоговорещите страни (Valentine's Day) и някои страни от Южна Америка (като „Празник на любовта и приятелството“). След 90-те години на 20 век добива известност и на други места (предимно от Третия свят)- основно от рекламни кампании на производители на цветя и сладкарски продукти.В Бразилия на 12 юни се празнува т.нар. Ден на влюбените (на португалски: Dia dos Namorados) като по същество той е идентичен на празника на Св. Валентин – има размяна на подаръци (шоколад картички) а на жените се подаряват букети цветя. Празникът се провежда ден преди този на Свети Антоний от Падуа (в португалоезичните страни познат още като Свети Антоний Лисабонски/от Лисабон) смятан за покровител на брака.Патрон на празникаИмето на празника идва от раннохристиянски мъченик наречен Валентин живял през 3 век. Най-напред празникът Свети Валентин е обявен за честване на 14 февруари от папа Геласий I около 494 г. През 19 век мощите на свети Валентин са дарени от папа Григорий XVI на дъблинската църква Whitefriar Street Carmelite в Ирландия която после станала често посещавана на 14 февруари.Св. Валентин не фигурира в официалния календар на Католическата църква. Православната Църква го чества на 6 юли.[1]Според Католическата енциклопедия (1908 г.) има поне трима светци наречени Валентин. Всички те са били мъченици и са записани под датата 14 февруари:[2]римски свещеник – понесъл мъченичество през втората половина на 3 век и погребан на пътя Виа Фламиния;епископът на Интермамна (днешен Терни) – също понесъл мъченичество през втората половина на 3 век и погребан на пътя Виа Фламиния но не на същото място като свещеника;мъченик в Африка за когото не се знае почти нищо друго.Връзката между Свети Валентин и романтичната любов не е спомената в нито един ранен исторически документ и се счита чисто и просто за легенда. Самият Свети Валентин е свързван първоначално с покровителство над епилептиците. През 1969 г. като част от по-голям опит да намали броя на празниците с чисто легендарен произход Католическата църква премахва празника на Свети Валентин от официалния си календар.",
    },
    {
      ID: 3,
      Title: "МАДАРА TRAIL 2026 С НОВИ ПРИЯТЕЛИ",
      Pic: "../../images/blogAndNewsImages/madaraRun2.jpg",
      PostedDate: "3/1/2026",
      PostedBy: "Irina",
      BOrN: "blog",
      InfoBlogAndNews:
        "Shumen Early Runners привлече нови съмишленици които искат да се включат и подкепят МАДАРА TRAIL 2026. Обменихме идеи благодарение на изложението “ПО-ШУМЕН ГРАД ЕХРО” в което участвахме. Всички са убедени че глобалния символ на България – Мадарския конник има нужда от повече популярност като чрез различни събития се утвърждава неговата значимост. Това е и каузата на сдружението на шуменските ранобудни бегачи. Надяваме се заедно да направим спортното събитие МАДАРА TRAIL 2026 и да зарадваме участниците с интересни награди и подаръци. Датата е 5 април нали не сте забравили?За регистрация тук:https://tracksport.live/e/madara-trail-2026",
    },
    {
      ID: 4,
      Title: "StenataRun",
      Pic: "../../images/blogAndNewsImages/stenataRun.jpg",
      PostedDate: "5/25/2026",
      PostedBy: "Rado",
      BOrN: "news",
      InfoBlogAndNews:
        "ЗА ПЪРВИ ПЪТ В ШУМЕН!СТЕНАТА RUN – ШУМЕНСКО ЕЗЕРО 2025 На 18.05.2025 г. (неделя) ранобудните бегачи на Шумен ви предизвикват с обиколки на стената на яз Шумен или както си го знаем – Шуменското езеро.За първи път ще предизвикаме издържливостта си по РАВЕН терен и ще проверим устойчивостта си в рамките на фиксирано време.Участниците се състезават кой ще направи най-много обиколки в рамките на 6 или 3 часа ще има и щафети по двама като всеки бяга по 1 час. Класирането се прави на база брой избягани обиколки. При равен брой обиколки в отборното класиране се гледа времето за което са избягани.Дисциплините:Обиколки индивидуално 3 часаОбиколки индивидуално 6 часаОбиколки отбори по двама – всеки бяга по 1 часПрограмата:6.00 ч. – раздаване на стартови номера в зоната на старта;7:00 ч. Старт индивидуални участници 6- и 3-часова дисциплина (6-часовата приключва в 13.00 ч. 3-часовата дисциплина приключва в 10:00 ч.)10:00 ч. Старт щафети от двама души(Приключват в 12:00 ч. )13.30 ч. Награждаване финал на събитиетоМястото:Стената на яз. Шумен Барбароса бийч. Дължина в посока – 900 м.ОЧАКВАЙТЕ ФОРМА ЗА РЕГИСТРАЦИЯ И ТРЕНИРАЙТЕ!",
    },
    {
      ID: 5,
      Title: "ПЪРВИ 5 КМ. ЗА 2006 ГОДИНА – ЗА ЗЕЛЕВ СОК",
      Pic: "../../images/blogAndNewsImages/zelevSok.jpg",
      PostedDate: "1/02/2026",
      PostedBy: "IrinaAndRado",
      BOrN: "bigNews",
      InfoBlogAndNews:
        "Стартираме 2026 г. надъхани за нови приключения и много настроение. Още в първия ден на годината тичахме „За зелев сок“. Забавното първо януарско събитие провеждаме за трета поредна година. Зелевият сок винаги е топ опция в първия ден след дългите празници. А съчетан с раздвижване дава добър старт на годината.След оспорвана дегустация всички определиха че най-атрактивния зелев сок е на Милко Милков той го гомбинира с айран и така спечели приза.  Кой каза че зимното бягане не е забавно? Всяка събота старт 8.30 часа от паркинга до паметник “Създатели на българската държава“ на шуменското плато.",
    },
  ]);

  const params = useParams();
  const id = params.blogAndNewsId;
  const blodAndNewsId = id - 1;
  //const img = blogOrNews[blodAndNewsId].Pic;

  // useEffect(() => {
  //   fetch("http://localhost:3000/BlogAndNews/" + id)
  //     .then((response) => response.json())
  //     .then((response) => {
  //       setBlogOrNews(response);
  //     })
  //     .catch((error) => console.log(error));
  // }, []);

  console.log(blogOrNews[blodAndNewsId].Pic);

  return (
    <div className={classes.mainContainer}>
      <div className={classes.titleAndPostedBy}>
        {blogOrNews[blodAndNewsId].Title}
      </div>
      <div>
        <div className={classes.postedByText}>
          posted by {blogOrNews[blodAndNewsId].PostedBy} |{" "}
          {blogOrNews[blodAndNewsId].PostedDate}
        </div>
        <span>
          <img className={classes.imgBlogAndNews} src={img} alt=""></img>
        </span>
        <p>{blogOrNews[blodAndNewsId].InfoBlogAndNews}</p>
      </div>
    </div>
  );
}
